In [1]:
import pandas as pd

In [ ]:
# The classis use cases are as follows : 
# WHats the avg salary per department 
# How many users joined gym per month

In [2]:
# sample data frame 
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [3]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [9]:
df.groupby('Department')['Salary'].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [11]:
df.groupby('Department')['Salary'].sum() # sum of salary of each dept

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [12]:
df.groupby('Department')['Salary'].count() # count of each department

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [14]:
df.groupby('Department')['Salary'].min() # min salaries in each department

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

In [15]:
df.groupby('Department')['Salary'].max() # max salaries in each dept

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [16]:
# applying multiple functuions at once 
df.groupby('Team')['Salary'].agg(['mean','min','max'])

      mean  min  max
Team
A     87.5   85   90
B     81.5   78   85
C     90.0   88   92
D     77.5   75   80

In [17]:
# naming of the column customized 
df.groupby('Team')['Salary'].agg(mean_team='mean', min_team='min',max_team='max')

      mean_team  min_team  max_team
Team
A          87.5        85        90
B          81.5        78        85
C          90.0        88        92
D          77.5        75        80

In [19]:
# transform : when we want to keep the original datafram and also the group level comp to each row unlike the agg function h
# suppose i want to add a column of mean salary againt each each row with the mean salary 
df['Avg_Salarie']=df.groupby('Department')['Salary'].transform('mean')
df

  Department Team Gender  Salary  Age   JoinDate  Avg_Salarie
0         HR    A      M      85   23 2020-01-10         87.5
1         HR    A      F      90   25 2020-02-15         87.5
2         IT    B      M      78   30 2021-03-20         81.5
3         IT    B      F      85   22 2021-04-10         81.5
4  Marketing    C      M      92   28 2020-05-30         90.0
5  Marketing    C      F      88   26 2020-06-25         90.0
6      Sales    D      M      75   21 2021-07-15         77.5
7      Sales    D      F      80   27 2021-08-01         77.5

In [23]:
# filter : suppose i want to get the rows with avg salaries>85 
df.groupby('Department').filter(lambda x: x['Salary'].mean()>85)

  Department Team Gender  Salary  Age   JoinDate  Avg_Salarie
0         HR    A      M      85   23 2020-01-10         87.5
1         HR    A      F      90   25 2020-02-15         87.5
4  Marketing    C      M      92   28 2020-05-30         90.0
5  Marketing    C      F      88   26 2020-06-25         90.0

In [ ]:
# write without the index